#I დავალება: შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას 
#კენტ ინდექსზე სიაში, გამოიყენეთ remove() ფუნქცია და for ციკლი.

print()

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

for i in range(len(numbers)-1, -1, -1):
    if numbers[i] % 2 == 0 or i % 2 == 1:
        numbers.remove(numbers[i])

print(numbers)

print()
print()


#II დავალება:  შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა 
#რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.

list_string = ["goga", "luka", "mate", "natali", "gega"]

height = len(list_string)

for i in range(height):
    list_string.append(list_string[i])

print(list_string)

print()
print()


#III დავალება: შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, 
#რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და 
#შესაფერისი სიის ფუნქცია.

list1 = ["goga" , "luka" , "mate", "natali", "nikoli", "gegi", "gega"]

list2 = [10, 20, 13, 40, 15, 16, 117, 33, 108, 90, 11]

for i in list2:
    if i > 20 and i < 50:
        list1.append(i)

print(list1)

print()
print()


#IV დავალება: შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for 
#ციკლი და სტრინგის შესაბამისი ფუნქცია.

word = ["Rezi", "Gega", "Dachi", "Saba", "Alexandre"]

for i in range(len(word)):
    if word[i][0].lower():
        word[i] = word[i].capitalize()

print(word)

print()
print()


#V დავალება: თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი.

#append() სიის ბოლოში სვამს ელემენტს
#remove() წაშლის ელემენტს მაგრამ ეს არის უშუალოდ ელემენტი სტრინგი
#reverse() ატრიალებს სიას უკუღმა
#clear() სიას მთლიანად შლის
#capitalize() პირველ ასოს ადიდებს
#lower() სიტყვას აპატარავებს
#upper() სიტყვას ადიდებს
#for ციკლით შეგვიძლია გავიმეოროთ ერთი და იგივე მოქმედება რამდენჯერაც გვინდა იმდენჯერ, და ასევე შეგვიძლია გადავუაროთ სიას
#pop() შლის ელემეტს მითითებულ ინდექსზე
#insert() ჩასვამს ელემენტს სიის კონკრეტულ ინდექსზე
#extend() მეორე სიას ამატებს
#index() გვეუბნება ელემენტის ინდექს
#count() ითვლის რამდენჯერ არის ელემენტი სიაში