#I დავალება: მომხმარებელს შემოატანინეთ ორი რიცხვი, შეამოწმეთ თუ პირველი რიცხვი მეტია მეორე რიცხვზე დაპრინტე რომ ‘first is
#more than second’, ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე დაპრინტე რომ ‘first is less than second’ და სხვა
#დანარჩენ შემთხვევაში დაპტინტე რომ ‘first number equal to second number’.
first = int(input("შეიყვანე პირველი რიცხვი: "))
second = int(input("შეიყვანე მეორე რიცხვი: "))

if first > second:
    print("პირველი მეტია მეორეზე")
elif first < second:
    print("პირველი ნაკლებია მეორეზე")
else:
    print("პირველი რიცხვი უდრის მეორე რიცხვს")


#II დავალება: მომხმარებელს შემოატანინე რაიმე სტრინგი, ასევე შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს, შემდეგ შეამოწმე თუ
#მომხმარებლის შემოყვანილი სტრინგი უდრის შენა სახელს დაუპრინტე რომ ‘სეხნიები ვართ’ სხვა შემთხვევაში დაუპრინტეთ რომ ‘სხვადასხვა 
#სახელები გავქვს’.
name_input = input("შეიყვანე შენი სახელი: ")

my_name = "Luka"

if name_input == my_name:
    print("სეხნიები ვართ")
else:
    print("სხვადასხვა სახელები გვაქვს")


#III დავალება: შექმენი ორი ცვლადი სადაც შეინახავთ ინტეჯერ ტიპოს მონაცემებს, თქვენი დავალებაა შეამოწმოთ, თუ პირველი რიცხვი მეტია
#0ზე და და მეორე რიცხვიც მეტია 0 ზე დაუპრინტე რომ ‘ორივე რიცხვი დადებითია, ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია 0ზე და
#მეორე რიცხვიც ნაკლებია 0 ზე დაპურინტე რომ  ‘ორივე რიცხვი არის უარყოფით’, სხვა დანარჩენ შემთხვევაში დაუპრინტე რომ ‘ეს რა
#ჯანდაბაა’.
num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

if num1 > 0 and num2 > 0:
    print("ორივე რიცხვი დადებითია")
elif num1 < 0 and num2 < 0:
    print("ორივე რიცხვი დადებითია")
else:
    print("ეს რა ჯანდაბაა")


#IV დავალება: დაატრიალეთ ფორ ლუპი 50 დან 100 მდე 2 ის გამოტივებით.
for i in range(50,100,2):
    print(i)


#V დავალება: ვაილ ლუპის გამოყენებით 20 დან 40 მდე გამოიტანეთ ყველა რიცხვი.
i = 20
while i < 40:
    print(i)
    i = i + 1