#I დავალება: for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე. 
#თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#თუ კენტია -> "კენტი"
#ფორმატით:
#1 კენტია
#2 ლუწია

print()

for i in range(1, 50):
    if i % 2 == 0:
        print(str(i) + "ლუწი")
    else:
        print(i, "კენტი")

print()
print()


#II დავალება: for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.
#- თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"
#- თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"
#- თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე"
#- სხვაგვარად -> "არ იყოფა არცერთზე"

for i in range(0, 20):
    if i % 3 == 0 and i % 5 == 0:
        print(i, "იყოფა 3-ზე და 5-ზე")
    elif i % 3 == 0:
        print(i, "იყოფა 3-ზე")
    elif i % 5 == 0:
        print(i, "იყოფა 5-ზე")
    else:
        print(i, "არ იყოფა არცერთზე")

print()
print()


#III დავალება: მომხმარებელს შემოატანინე რიცხვი.
#for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.
#დაბეჭდე შედეგი ამ ფორმატით:
#ლუწი რიცხვების რაოდენობა: X
#კენტი რიცხვების რაოდენობა: Y

X = 0
Y = 0

num = int(input("შეიტანე რიცხვი: "))

for i in range(0, num):
    if i % 2 == 0:
        X = X + 1
    elif i % 1 == 0:
        Y = Y + 1

print()
print()


#IV დავალება: მოცემულია სია -> [10, 25, 33, 47, 80, 99]
#for ციკლით დაუარე თითოეულ ელემენტს.
#თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე"
#თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".

numbers = [10, 25, 33, 47, 80, 99]

for i in range(0, 6):
    if numbers[i] > 50:
        print(numbers[i], "მეტი 50-ზე")
    else:
        print(numbers[i], "ნაკლები 50-ზე")

print()
print()


#V დავალება: for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.
#ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".

sum_even = 0

for i in range(0, 100):
    if i % 2 == 0:
        print(i)
        sum_even = sum_even + i

print("ლუწი რიცხვების ჯამია:", sum_even)

print()
print()


#VI დავალება: შექმენი სია და შეინახეთ შიგნით სტრინგები
#for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.

strings = ["airplane", "games", "fridge", "apron", "sharpie", "wallet", "apple", "canvas", "wrench", "dictionary"]

for i in range(0, 10):  
    if strings[i][0] == "a":
        print(strings[i])

print()
print()


#VII დავალება: for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.
#თუ რიცხვი არის ნული -> "ნულია"
#თუ კენტია -> "კენტია"
#თუ ლუწია -> "ლუწია".

for i in range(0, 20):
    if i == 0:
        print("ნულია")
    elif i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")

print()
print()


#VIII დავალება: შექმენი სია -> [5, 15, 25, 35, 45, 55]
#for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.

num = [5, 15, 25, 35, 45, 55]

for i in range(0, 6):
    if num[i] % 5 == 0:
        print(num[i])

print()
print()


#IX დავალება: შექმენი ცვლადი -> total = 0
#for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.
#ბოლოს დაბეჭდე -> "ჯამი არის: X".

total = 0

for i in range(1, 10):
    total = total + i

print("ჯამი არის:", total)

print()