#I დავალება: შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.

print()

random_sentence = "ეს რეალურია ხალხო?"
xmovnebi = "აეიოუ"

num = 0
for i in random_sentence:
    if i in xmovnebi:
        num += 1

print(num)

print()
print()


#II დავალება: შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

num = 0
for i in numbers:
    if i % 2 == 0:
        num += i

print(num)

print()
print()


#III დავალება: შექმენით რიცხვებით სავსე სია, გაიგეთ რომელი რიცხვი არის ამ სიაში ყველაზე დიდი, გამოიყენეთ for ციკლი, არ გამოიყენოთ max() 
#ფუნქცია.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

num = 0
for i in numbers:
    if i > num:
        num = i

print(num)

print()
print()


#IV დავალება: მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, როცა პაროლის 
#სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" გამოიყენეთ while ციკლი.

password = input("შეიყვანე შენი პაროლი: ")

while len(password) < 6:
    print("ძაან მოკლეა შენი პაროლი, გთხოვთ თავიდან სცადეთ.")
    password = input("შეიყვანე შენი პაროლი: ")

print("Your password is correct!")

print()
print()


#V დავალება: შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, აუცილებლად იგივე 
#თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.

numbers = [3, 5, 3, 8, 5, 10, 8]

repeated_numbers = []

for i in numbers:
    if i not in repeated_numbers:
        repeated_numbers.append(i)

print(repeated_numbers)

print()
print()


# VI დავალება: მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ რამდენჯერ 
# მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს 
# Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ 
# გამოიყენოთ count() ფუნქცია.

sentence = input("შეიყვანე რაიმე წინადადება: ")

words = []
word = ""

for i in sentence:
    if i != " ":
        word += i
    else:
        words.append(word)
        word = ""

if word:
    words.append(word)

duplicants = []

for i in words:
    if i not in duplicants:
        count = 0
        for x in words:
            if x == i:
                count += 1
        print(i , count)
        duplicants.append(i)

print()
print()


#VII დავალება: შექმენით რაიმე რიცხვის ცვლადი და მომხმარებელს შემოატანინეთ რიხვი, მომხმარებელმა უნდა შეეცადოს რომ გამოიცნოს ჩვენი რიცხვი, თუ 
#მისი შემოტანილი რიცხვი არ უდრის ჩვენს რიცხვს, მაშინ ისევ თავიდან შემოატანინეთ მანამ სანამ არ გამოიცნობს. როცა ჩვენს რიცხვს გამოიცნობს, დაპრინტეთ 
#თუ რამდენი ცდა მოუწია მანამ სანამ გამოიცნო, მაგალითად: "Correct! Attempts: 10" გამოიყენეთ while ციკლი.

num = 855721
guess = input("გამოიცანი რიცხვი: ")

tries = 0
while int(guess) != num:
    tries += 1
    print("არასწორია")
    guess = input("გამოიცანი რიცხვი: ")

print("სწორია! შენ არასწორად გამოიცანი" , tries , "-ჯერ")

print()