#I დავალება: დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში.
for i in range(0, 39):
    print(i)


#II დავალება: დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში.
for i in range(30,40):
    print(i)


#III დავალება: დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში.
for i in range(12,120):
    print(i)


#IV დავალება: დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც, ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ.
for i in range(18):
    print("Luka 16")


#V დავალება: დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში.
for i in range(10,100,3):
    print(i)


#VI დავალება: ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი:
#1 ფორთოხალი
#2 ფორთოხალი
#3 ფორთოხალი
#4 ფორთოხალი
#5 ფორთოხალი
#.... 
#....
#....
#30 ფორთოხალი
for i in range(1,31):
    print(str(i) + "kiwi")


#VII დავალება: მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop.
for i in range(13):
    print(input("Enter your age: "))


#VIII დავალება: გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით.
i = 0
while i < 10:
    print("Luka")
    i = i + 1


#IX დავალება: დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop.
i = 0
while i < 24:
    print(i)
    i = i + 1


#X დავალება: იმუშავეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ.
for i in range(7,832,77):
    print(i)

i = 5
while i < 965:
    print(i)
    i = i + 5

i = 89
while i < 1111:
    print(i)
    i = i + 78

for i in range(9,99):
    print("nu-metal")

for i in range(33):
    print(str(i) + "Jesus")

for i in range(24,42):
    print(str(i) + "shutter" + "island")