#I დავალება: შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
#--> გამოიტანეთ პირველი 5 ელემენტი
#--> გამოიტანეთ ბოლო 3 ელემენტი
#--> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით

numbers = [1,2,3,4,5,6,7,8,9,10]
print(numbers[0:5])
print(numbers[7:])
print(numbers[3:8])
print()
print()


#II დავალება: შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
#--> გამოიტანეთ პირველი 6 ელემენტი
#--> გამოიტანეთ ბოლო 10 ელემენტი
#--> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
print(numbers[-15:-9])
print(numbers[-10:])
print(numbers[-8:])
print()
print()


#III დავალება: 3) მოცემულია სიტვა 'თვითმფრინავი'
#გამოიტანეთ 'ნავი'

word = "თვითმფრინავი"
print(word[-4:])
print()
print()


#IV დავალება: მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
#--> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით

word = "Programmer"
print(word[0:3])
print(word[:-7])
print()
print()


#V დავალება: შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
#--> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
#--> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)

the_week = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]
print("სამუშაო დღეები:")
print(the_week[0:5])
print(the_week[-7:-2])
print()
print("დასვენების დღეები:")
print(the_week[5:])
print(the_week[-2:])
print()
print()


#VI დავალება: მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
#გამოიტანეთ: 
#'Python'
#'slicing'
#'powerful'
#გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები

sentence = "Python slicing is very powerful"
print(sentence[0:6])
print(sentence[:-25])
print()
print(sentence[7:14])
print(sentence[-24:-17])
print()
print(sentence[23:32])
print(sentence[-8:])

word = "run"
word[0] = "f"
print(word)