#I დავალება: შექმენით რიცხვებით სავსე სია და ახალ სიაში ჩააგდეთ ყველა რიცხვი გამრავლებული 2-ზე. დაპრინტეთ ახალი სია.

print()

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
numbers = []

for i in nums:
    numbers.append(i * 2)

print(numbers)

print()
print()


#II დავალება: შექმენით სახელებით სავსე სია, მომხმარებელს შემოატანინეთ რაიმე რიცხვი, და ამ რიცხვის ინდექსზე ჩაამატეთ სახელი "ნიკა" თქვენს სიაში.

names = ["გოგა", "ლუკა", "საბა", "ნატალი", "მათე"]
num = int(input("შეიყვანე რიცხვი: "))

names.insert(num , "ნიკა")
print(names)

print()
print()


#III დავალება: შექმენით string წინადადების ცვლადი, ამ წინადადებიდან დაპრინტეთ მხოლოდ ხმოვანი ასოები.

sentence = "მე ძალიან მიყვარს გოა-ს აკადემია"
xmovnebi = "აეიოუ"

for i in sentence:
    if i in xmovnebi:
        print(i)

print()
print()


#IV დავალება: შექმენით სტრინგებით სავსე სია, წაშალეთ ის სტრინგ მონაცემთა ტიპის ელემენტები რომლებიც არიან 4-ზე მეტი სიგრძეში ან დგანან კენტ 
#ინდექსზე. გამოიყენეთ remove() ფუნქცია.

words = ["Python", "CSS", "JavaScript", "Java", "HTML"]

for i in words:
    if len(i) > 4 or words.index(i) % 2 == 1:
        words.remove(i)

print(words)

print()
print()


#V დავალება: შექმენით რიცხვებით სავსე სია, გამოითვალეთ რიცხვების საშუალო არითმეტიკული - რიცხვების ჯამი გაყოფილი რიცხვების რაოდენობაზე.

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

total = 0
for i in nums:
    total += i

average = total / len(nums)
print(average)

print()