#I დავალება: მომხმარებელს შემოაყვანინეთ სახელი, შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

print()

name = input("Type in a name in lower-case letters: ")
print(name.upper())

print()
print()


#II დავალება: მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით, შენი დავალებაა რომ დაპრინტო მისი სახელი ოღონდ პატარა ასოებით

name = input("Type in a name in upper-case letters: ")
print(name.lower())

print()
print()


#III დავალება: შემოაყვანინეთ სახელი პატარა ასოებით, შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

name = input("Type in a name in lower-case letters: ")
print(name.capitalize())

print()
print()


#IV დავალება: შექმენით სია, შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით, თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო
#თითიეული სახელი ოღონდ დიდი ასოებით

names = ["luka", "nino", "tamari", "goga", "gegi", "gega"]
for i in names:
    print(i.upper())

print()
print()


#V დავალება: შექმენით სია, შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით, თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო 
#თითიეული სახელი ოღონდ პატარა ასოებით

names = ["LUKA", "NINO", "TAMARI", "GOGA", "GEGI", "GEGA"]
for i in names:
    print(i.lower())

print()
print()


#VI დავალება: შექმენით სია, შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით, თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო
#თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს

names = ["natali", "nikoli", "daviti", "giga", "rezi"]
for i in names:
    print(i.capitalize())

print()
print()


#VII დავალება: შექმენი სია სადაც მოათავსებ ელემენტებს, თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,
#გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

list1 = ["mega", "death", "system", "down", "deaf", "tones", "panther", "slayer"]
print(len(list1))

print()
print()


#VIII დავალება: შექმენი სტრინგი --> ალექსანდრე, თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი, გამოიყენეთ
#ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

random = "ალექსანდრე"
print(len(random))

print()
print()


#IX დავალება: შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს, თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 
37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 
74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100]

count = 0

for i in numbers:
    if i % 2 == 0:
        count += 1

print("ლუწი რიცხვების რაოდნობა: ", count)

print()
print()


#X დავალება: შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს, თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 
37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 
74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100]

count = 0

for i in numbers:
    if i % 2 != 0:
        count += 1

print("კენტი რიცხვების რაოდნობა: ", count)

print()
print()


#XI დავალება: მომხმარებელს შემოაყვანინე ორი რიცხვი start, end და step, თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start-იდან end-ამდე და სტეპი იყოს
#step, ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("lowest number: "))
end = int(input("high number:  "))
step = int(input("random number must be 1-10: "))

if step == 0:
    print("step cannot be 0. restart")
else:
    for i in range(start, end, step):
        if i % 2 == 0:
            print(i)

print()