#I დავალება: ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი, 5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True.
# True:
print(5 > 6 or 9.45 == 9.45)
print(8334 > 723 or 43 == 43)
print(71 * 90 > 5600 and 31 > 0.9)
print(17 > 1 * 7 and 441 > 4 * 41)
print(98 < 3854 or 77 * 77 > 777)

# False:
print(71.1 > 71.1 and 5 > 6)
print(67.9 > 68 and 420 == 420)
print(2 + 2 > 7 or 76 > 696)
print(42 * 2 < 81 or 0.1 < -1)
print(-32 * 4 > 32 and -54 > -1)


#II დავალება: კომენტარის სახით დაწერეთ თუ რა არის sequancing, iteration, selection აღწერე თითეული მათგანი თქვენი სიტყვებით.
# Sequencing:
# თანმიმდევრობა. ამის მაგალითია ჩვენი დაწერილი კოდი, რომელიც იკითხება კომპიუტერის მიერ ზემოდან ქვემოთ. ეს ნიშნავს, რომ კომპიუტერი ჩვენს კოდს თანმიმდევრობით ასრულებს.

# Iteration:
# გამეორება, როდესაც რაღაც მოქმედება მეორდება რამდენჯერმე ან სულ (სამუდამოდ). ასევე Iteration წარმოდგენილი არის როგორც Loop (გამეორება).

# Selection:
# არჩევა. განსაზღვრავს, როდის უნდა მიჰყვეთ თითოეულ გზას.


#III დავალება: მოიყვანე secuencing-ის მაგალითი და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence.
# დილით სკოლაში წასვლა:
# 1.გაღვიძება
# 2.პირადი ჰიგიენის დაცვა
# 3.ტანსაცმლის ჩაცმა
# 4.საუზმობა
# 5.ჩანთის აღება და სკოლაში წასვლა
# ვთქვათ ჯერ სკოლაში წახვედი და მერე ჩაიცვი ტანსაცმელი, ეგ არასწორია. ან კიდე რაც ჩამოვთვალეთ ყველაფრის გაკეთება, მერე სკოლაში წასვლა და ბოლოს გაღვიძება, ეგეც არასწორია. ყველაფერი უნდა იყოს თანმიმდევრობით.


#IV დავალება: კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის.
# for loop არის ციკლი, რომელიც გამოიყენება მაშინ, როცა გვინდა მოქმედება გავიმეოროთ რამდენჯერმე


#V დავალება: კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop.
# range() არის ფუნქცია, რომელიც აბრუნებს რიცხვების თანმიმდევრობას. მაგ:
# range(5) ნიშნავს რიცხვებს 0-დან 5-მდე (0, 1, 2, 3, 4)

# როგორ მუშაობს for loop?:
# for i in range(). i იღებს მნიშვნელობად თითოეულ რიცხვს 0-დან range() ფუნქციაში გადაცემულ რიცხვამდე (არა ჩათვლით).

# for loop-ის მაგალითი:
for i in range(5):
    print(i)


#VI დავალება: შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop.
for i in range(1):
    print("Mercedes")


#VII დავალება: შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ.
for i in range(100):
    print("Jobava")


#VIII დავალება: შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ.
for i in range(46):
    print("Black")


#IX დავალება: შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ.
for i in range(32):
    print("L")


# ----------------------------------------------------------გამეორება------------------------------------------------------------

#X დავალება: მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია (გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია).
# მნიშვნელობები:
string1 = input("Type in first string: ")
string2 = input("Type in second string: ")
string3 = input("Type in third string: ")
num = int(input("Type in an integer number: "))

# კონკატინაცია:
result = string1 + string2 + string3 + str(num)

# შედეგი:
print(result)


#XI დავალება: შექმენი 4 ცვლადი, თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები, შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი (გამოიყენე შესაბამისი ფუნქცია).
# 4 ცვლადი:
name = "Luka"
age = 16
height = 1.75
is_a_pupil = True

# მათი ტიპები:
print(type(name))
print(type(age))
print(type(height))
print(type(is_a_pupil))


#XII დავალება: 
# რიცხვების შემოტანა: მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი.
num1 = int(input("Type in first number: "))
num2 = int(input("Type in second number: "))
num3 = int(input("Type in third number: "))
num4 = int(input("Type in fourth number: "))

# მათი ჯამი:
result = num1 + num2 + num3 + num4

# შედეგი:
print(result)