#I დავალება: შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება თქენს პირველ სიაში მყოფი მხოლოდ ლუწი 
#რიცხვები. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.

print()

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

even_numbers = []

for i in numbers:
    if i % 2 == 0:
        even_numbers.append(i)

print(even_numbers)

print()
print()


#II დავალება: შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება მხოლოდ თქენს პირველ სიაში კენტ ინდექსზე 
#მდგომი რიცხვები რომელბიც არიან აუცილებლად კენტი. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

odd_numbers = []

for i in range(len(numbers)):
    if i % 2 == 1 and numbers[i] % 2 == 1:
        odd_numbers.append(numbers[i])

print(odd_numbers)

print()
print()


#III დავალება: შექმენით სახელებით სავსე სია და ამ სიიდან ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება ასო გ-თი და მთავრდება ასო ი-თი, გამოიყენეთ for 
#ციკლი, დაწერეთ ორივე ხერხით, pop() ფუნქციითაც და remove() ფუნქციითაც.

names = ["გოგა", "ლუკა", "მათე", "ნატალი", "რეზი", "გიგა", "გეგი", "გეგა", "გურამი"]

for i in names[:]:
    if i[0] == "გ" and i[-1] == "ი":
        names.remove(i)

print(names)

names = ["გოგა", "ლუკა", "მათე", "ნატალი", "რეზი", "გიგა", "გეგი", "გეგა", "გურამი"]

for i in range(len(names) - 1, -1, -1):
    if names[i][0] == "გ" and names[i][-1] == "ი":
        names.pop(i)

print(names)

print()
print()


#IV დავალება: შექმენით სტრინგებით სავსე სია, და ამ სიიდის ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და რომელიც ამავდროულად დგას 
#კენტ ინდექსზე სიაში, გაუხადეთ ასეთ სიტყვებს ყველა ასო პატარა - lowercase, ხოლო ყველა ის სიტყვა რომლის პირველი ასო არის Uppercase-ში და თან ეს 
#სიტყვა დგას ლუწ ინდექსზე სიაში, ამოშალეთ სიიდან. დაპრინტეთ შეცვლილი სია.



print()
print()


#V დავალება: შექმენით სიტყვებით სავსე სია, ამ სიიდან ამოშალეთ ყველა სიტყვა რომელიც იწყება Uppercase დიდი ასო G-თი და რომლის ბოლო 2 ასო არის 
#ასევე Uppercase. ხოლო ყველა სიტყვა რომლის თითოეული ასო არის Lowercase-ში, აიყვანეთ Uppercase-ში შესაბამისი სტრინგის ფუნქციის გამოყენებით. 
#დაპრინტეთ მიღებული სია.



print()
print()


#VI დავალება: შექმენით 2 სია, პირველ სიაში იყოს int მონაცემთა ტიპის ელემენტები, ხოლო მეორე სია სავსე იყოს string მონაცემთა ტიპის ელემენტებით. For 
#ციკლის საშუალებით, პირველი სიიდან remove() ფუნქციით ამოშალეთ ყოველი ლუწი რიცხვი რომლებიც დგანან კენტ ინდექსზე, ხოლო მეორე სიიდან pop() 
#ფუნქციით ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება დიდი ასოთი და დგას ლუწ ინდექსზე. ბოლოს შეაერთეთ ორივე შეცვლილი სიები ერთმანეთში, 
#გახადეთ საერთო სია და დაპრინტეთ. (კარგად დააკვირდით პირობას და არ იჩქაროთ. წარმატებები! ! !)



print()