#I დავალება: შექმენით ცვლადი სადაც შეინახავთ ინტეჯერ ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ
#შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10".
number = 11 

if number > 10:
    print("more than 10")
else:
    print("less than 10")


#II დავალება: მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15-ს დაუპრინტეთ "equal to 15" სხვა
#შემთხვევაში დაუპრინტეთ "not equal to 15".
number = int(input("შეიყვანე რიცხვი: "))

if number == 15:
    print("equal to 15")
else:
    print("not equal to 15")


#III დავალება: მომხმარებელს შემოატანეთ სტრინგი შენი დავალებაა შეამოწმო,თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის giorgi
#დაუპრინტეთ "you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong".
name = input("შეიყვანე სახელი: ")

if name == "giorgi":
    print("you are correct")
else:
    print("you are wrong")


#IV დავალება: დაატრიალეთ ფორ ციკლი 50 დან 100 მდე 5 ის გამოტოვებით.
for i in range(50,100,5):
    print(i)


#V დავალება: ფორ ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი.
for i in range(1):
    print("ლუკა ჯობავა")


#VI დავალება: while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე.
for i in range(20,50):
    print(i)