#I დავალება: მოცემულია სია --> [1, 2, 3, 4, 5, 6]
#შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

print()
numbers = [1, 2, 3, 4, 5, 6]

numbers[2:4] = [10, 20, 30]
print(numbers)

print()
print()


#II დავალება: მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
#შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

fruits = ["apple", "banana", "cherry", "kiwi", "mango"]

fruits[0:2] = ["pear", "plum"]
print(fruits)

print()
print()


#III დავალება: მოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
#შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

letters = ["a", "b", "c", "d", "e", "f"]

letters[-3:] = ["x", "y", "z"]
print(letters)

print()
print()


#IV დავალება: მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
#შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

colors = ["red", "green", "blue", "yellow", "black", "white"]

colors[2:6] = ["purple", "orange"]
print(colors)

print()
print()


#V დავალება: მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
#შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

names = ["გიორგი", "ირმა", "საბა"]

names[:] = ["red", "green", "blue", "yellow", "black", "white"]
print(names)

print()
print()


#VI დავალება: მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი, თუ ლუწია დაპრინტე --> "Even",
#თუ კენტია დაპრინტე --> "Odd".

num = int(input("შეიყვანე რიცხვი: "))

if num % 2 == 0:
    print("Even")
else:
    print("Odd")

print()
print()


#VII დავალება: შექმენი სია --> სადაც შეინახავ ინტეჯერებს, შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არის ლუწი დაპრინტე -->
#"Even number", თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

numbers = [1, 3, 6, 9, 12, 15, 18]

if numbers[3] % 2 == 0:
    print("Even number")
else:
    print("Odd number")

print()
print()


#VIII დავალება: შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე -->
#"ეს რიცხვი არის ლუწი და მეტი 50 ზე", თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

nums = [10, 21, 32, 43, 54, 65]

if nums[-1] % 2 == 0 and nums[-1] > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif nums[-1] % 2 != 0 and nums[-1] < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")

print()
print()


#IX დავალება: შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე -->
#"even or more than 100", თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100

nums2 = [50, 12, 67, 96, 420, 101, 333]

if nums2[5] % 2 == 0 or nums2[5] > 100:
    print("even or more than 100")
if nums2[3] % 2 != 0 or nums2[3] < 100:
    print("odd or less than 100")

print()
print()


#X დავალება: შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს, შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს, გამოიყენე ახლად ნასწავლი
#ოპერატორი != 

str1 = "W"
str2 = "speed"

if str1 != str2:
    print("სტრინგები განსხვავებულია")
else:
    print("სტრინგები ტოლია")

print()