#I დავალება: მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც.
print()
print(5 + 3)
print(10 + 20)
print(-4 + 6)
print()

print(10 - 4)
print(7 - 15)
print(-3 - (-7))
print()

print(4 * 6)
print(7 * -2)
print(0 * 100)
print()

print(8 / 2)
print(7 / 3)
print(-9 / 3)
print()

print(2 ** 3)
print(5 ** 2)
print(9 ** 0.5)
print()

print(7 // 2)
print(10 // 3)
print(-9 // 2)
print()

print(7 % 2)
print(10 % 3)
print(-9 % 2)
print()
print()


#II დავალება: კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინი.

# ჩვენ ვისწავლეთ შემდეგი მათემატიკური ოპერატორები: //, ** და %.

# // - ასეთი გაყოფა გვიბრუნებს ყოველთვის ინტეჯერ ტიპის მონაცემს (მთელ რიცხვს) და პასუხად გვაძლევს: თუ რამდენჯერ მოთავსდება
#ერთი რიცხვი მეორე რიცხვში.

# ** - ეს ოპერატორი გვეხმარება, რომ რიცხვი ავიყვანოთ რაიმე ხარისხში.

# % - გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყოფთ მეორე რიცხვზე. 


#III დავალება: დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი, ანუ სულ 15 მაგალით უნდა გქონდეთ.
print(12 // 11)
print(67 // 45)
print(9000.1 // 11)
print(459.8 // 76)
print(12 // 0.8)
print()

print(4.678 ** 7)
print(32 ** 2)
print(68 ** 5)
print(5.5 ** 10)
print(54 ** 8)
print()

print(5468 % 0.3942)
print(35 % 4.6)
print(12 % 4.7)
print(48 % 12)
print(8970 % 34)
print()
print()


#IV დავალება: ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები (დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები):

# 15 / 3 = 5
# 20 / 4 = 5
# 100 / 20 = 5

# 15 // 10 = 1
# 10 // 7 = 1
# 40 // 12 = 3

# 4 * 3 = 12
# 40 * 3 = 120
# 120 * 3 = 360

# 4 ** 3 = 64
# 10 ** 3 = 1000
# 2 ** 6 = 64
# 3 ** 4 = 81

# 10 % 7 = 3
# 3 % 2 = 1
# 50 % 25 = 0
# 14 % 11 = 3
# 110 % 50 = 10


#V დავალება: კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს, და რით განსხვავდებიან ისინი ცვლადებისაგან.
# რისთვის ვიყენებთ list-ებს:
# სიები გვეხმარება, რომ შევინახოთ მრავალი ელემენტი (ნებისმიერი მონაცემთა ტიპის და ნებისმიერი რაოდენობის).
# რითი განსხვავდებიან ერთმანეთისგან list-ები და ცვლადები:
# list - ინახავს ბევრ მონაცემს ერთ სახელზე.
# ცვლადი - ინახავს ერთ მონაცემს.


#VI დავალება: შექმენი სია, შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები.
list_1 = ["Electric guitar", "Guitar", "Bass", "Drums", "Microphone"]
print(list_1)


#VII დავალება: შექმენი სია, შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები.
list_2 = [9, 10, 21, 41, 67]
print(list_2)


#VIII დავალება: შექმენი სია, შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები.
list_3 = [3.1, 4.1, 5.9, 2.6, 5.3]
print(list_3)


#IX დავალება: შექმენი სია, შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები.
list_4 = [True, False]
print(list_4)


#X დავალება: შექმენით სია, შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი.
list_5 = ["Band", 4, 4.3, True]
print(list_5)
print()
print()

#=====================================================  BONUS  ===================================================================


#XI დავალება: მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები (თან
#დაპრინტეთ რომ ნახოთ შედეგი).
num1 = float(input("Enter the first number: "))
num2 = float(input("Enter the second number: "))

print(num1 // num2)
print(num1 ** num2)
print(num1 % num2)
print()
print()


#XII დავალება: მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30-ზე
#მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე -->
#"between 100 and 200", სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number".
entered_number = int(input("Enter a number: "))

if entered_number >= 30 and entered_number <= 100:
    print("between 30 and 100")
elif entered_number >= 101 and entered_number <= 200:
    print("between 100 and 200")
else:
    print("other number")
print()
print()


#XIII დავალება: შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები (გამოიყენეთ ნასწავლი ფუნქცია).
name = "Adrian"
mm_number = 41
MM_number = 67.67
is_funny = True

print(type(name))
print(type(mm_number))
print(type(MM_number))
print(type(is_funny))
print()
print()


#XIV დავალება: while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...
i = 50
while i < 100:
    print(i)
    i += 5
print()
print()


#XV დავალება: for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...
for i in range(40,90,3):
    print(i)
print()
print()


#XVI დავალება: გამოიტანე შენი სახელი და გვარი 15 ჯერ, გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით.
for i in range(15):
    print("Luka Jobava")
print()

i = 0
while i < 15:
    print("Luka Jobava")
    i += 1
print()
print()


#XVII დავალება: 
#შექმენი ცვლადი სადაც შეინახავ შენს სახელს
#შექმენი ცვლადი სადაც შეინახავ შენს გვარს
#მომხმარებელს შემოატანინეთ სახელი
#თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#      მომხმარებელს შემოატანინე გვარი
#      თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#            დაპრინტე --> same name and surname
#      სხვა შემთხვევაში
#            დაპრინტე -- > same name but different surname
#სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#    დაპრინტე --> aqedan moshordi

my_name = "Luka"
my_last_name = "Jobava"

entered_name = input("Enter your name: ")

if entered_name == my_name:
    entered_last_name = input("Enter your last name: ")
    if entered_last_name == my_last_name:
        print("same name and surname")
    else:
        print("same name but different surname")
else:
    print("aqedan moshordi")
print()
print()


#XVIII დავალება: 
#შექმენი ცვლადი სადაც შეინახავ პაროლს
#მომხმარებელს შემოატანინე პაროლი
#სანამ პირობა არის ჭეშმარიტი(True)
#      თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#            დაპრინტე --> გამოიცანი
#             break
#      სხვა შემთხვევაში:
#          თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

my_password = "GoaTheGoat"

while True:
    entered_password = input("შეიყვანე პაროლი: ")
    
    if entered_password == my_password:
        print("გამოიცანი")
        break
    else:
        print("პაროლი არასწორია, სცადე თავიდან.")