# ჩვენ ვისწავლეთ შემდეგი მათემატიკური ოპერატორები: //, ** და %.
# // - ასეთი გაყოფა გვიბრუნებს ყოველთვის ინტეჯერ ტიპის მონაცემს (მთელ რიცხვს) და პასუხად გვაძლევს: თუ რამდენჯერ მოთავსდება ერთი რიცხვი მეორე რიცხვში. მაგ: 
print(13//7)
print(74//73)
print(14//3)
# ** - ეს ოპერატორი გვეხმარება, რომ რიცხვი ავიყვანოთ რაიმე ხარისხში. მაგ: 
print(34**3)
print(67**67)
print(41**14)
# % - გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყოფთ მეორე რიცხვზე. მაგ: 
print(64 % 12)
print(12 % 8)
print(89 % 14)


# რისთვის ვიყენებთ list-ებს:
# სიები გვეხმარება, რომ შევინახოთ მრავალი ელემენტი (ნებისმიერი მონაცემთა ტიპის და ნებისმიერი რაოდენობის).
# რითი განსხვავდებიან ერთმანეთისგან list-ები და ცვლადები:
# list - ინახავს ბევრ მონაცემს ერთ სახელზე.
# ცვლადი - ინახავს ერთ მონაცემს.


my_list = [41, 67.67, "Hello", True]
print(my_list)